# Getting Started with pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

u'd:\\inbox\\resources\\pydata-book-master'

## intro to panda data structures

there are two data structures: series and dataframe.

### Series

series is 1dimensional array like object containing an array of data and an associated array of data labels, called its index

In [4]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [9]:
#you can use values in the index for single or a set of values
obj2['a']

-5

In [10]:
obj2['d'] = 6
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [11]:
# warisannya numpy masih tetep bisa dipake
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
# finding key ?
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Semarang' : 20000, 'Salatiga' : 10000, 'Jogja' : 15000, 'Klaten' : 5000}
obj3 = Series(sdata)
obj3

Jogja       15000
Klaten       5000
Salatiga    10000
Semarang    20000
dtype: int64

In [18]:
kutha = ['Manokwari', 'Salatiga', 'Jogja', 'Klaten']
obj4 = Series (sdata, index = kutha)
obj4
#Nan stand for not a number, missing.

Manokwari        NaN
Salatiga     10000.0
Jogja        15000.0
Klaten        5000.0
dtype: float64

In [19]:
#checking missing ? 
pd.isnull(obj4)

Manokwari     True
Salatiga     False
Jogja        False
Klaten       False
dtype: bool

In [20]:
pd.notnull(obj4)

Manokwari    False
Salatiga      True
Jogja         True
Klaten        True
dtype: bool

In [21]:
#it can be written like this also
obj4.isnull()

Manokwari     True
Salatiga     False
Jogja        False
Klaten       False
dtype: bool

In [22]:
obj3

Jogja       15000
Klaten       5000
Salatiga    10000
Semarang    20000
dtype: int64

In [23]:
obj4

Manokwari        NaN
Salatiga     10000.0
Jogja        15000.0
Klaten        5000.0
dtype: float64

In [24]:
obj3 + obj4

Jogja        30000.0
Klaten       10000.0
Manokwari        NaN
Salatiga     20000.0
Semarang         NaN
dtype: float64

In [25]:
obj4.name = 'karcis bus'
obj4.index.name = 'tujuan'
obj4

tujuan
Manokwari        NaN
Salatiga     10000.0
Jogja        15000.0
Klaten        5000.0
Name: karcis bus, dtype: float64

In [26]:
#replacing index
obj.index = ['Joko', 'Paidi', 'Budhi', 'Supratman']
obj

Joko         4
Paidi        7
Budhi       -5
Supratman    3
dtype: int64

### DataFrame

a dataframe represent a tabular, spreadsheet-like data structure containining an ordered collection of columns, each of which can be a different value type(numeric, string, boolean, etc.)

In [27]:
data = {'kutha' : ['Semarang','Semarang','Semarang','Solo','Solo'],
       'taun' : ['2000','2001','2002','2001','2002'],
       'pop' : [1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

      kutha  pop  taun
0  Semarang  1.5  2000
1  Semarang  1.7  2001
2  Semarang  3.6  2002
3      Solo  2.4  2001
4      Solo  2.9  2002

In [28]:
DataFrame(data, columns=['taun','kutha','pop'])

   taun     kutha  pop
0  2000  Semarang  1.5
1  2001  Semarang  1.7
2  2002  Semarang  3.6
3  2001      Solo  2.4
4  2002      Solo  2.9

In [29]:
frame2 = DataFrame(data,columns=['taun','kutha','pop','debt'],
                  index = ['one','two','three','four','five'])
frame2

       taun     kutha  pop debt
one    2000  Semarang  1.5  NaN
two    2001  Semarang  1.7  NaN
three  2002  Semarang  3.6  NaN
four   2001      Solo  2.4  NaN
five   2002      Solo  2.9  NaN

In [30]:
frame2.columns

Index([u'taun', u'kutha', u'pop', u'debt'], dtype='object')

In [31]:
#retrieve col
frame2['kutha']

one      Semarang
two      Semarang
three    Semarang
four         Solo
five         Solo
Name: kutha, dtype: object

In [32]:
frame2.taun

one      2000
two      2001
three    2002
four     2001
five     2002
Name: taun, dtype: object

In [33]:
#retrieve row
frame2.ix['three']

taun         2002
kutha    Semarang
pop           3.6
debt          NaN
Name: three, dtype: object

In [34]:
#assign a column values
frame2.debt = 16.5
frame2

       taun     kutha  pop  debt
one    2000  Semarang  1.5  16.5
two    2001  Semarang  1.7  16.5
three  2002  Semarang  3.6  16.5
four   2001      Solo  2.4  16.5
five   2002      Solo  2.9  16.5

In [35]:
frame2.debt = np.arange(5.)
frame2

       taun     kutha  pop  debt
one    2000  Semarang  1.5   0.0
two    2001  Semarang  1.7   1.0
three  2002  Semarang  3.6   2.0
four   2001      Solo  2.4   3.0
five   2002      Solo  2.9   4.0

In [36]:
val = Series([-1.2,-1.5,-1.7], index = ['two', 'four', 'five'])
frame2 ['debt'] = val
frame2

       taun     kutha  pop  debt
one    2000  Semarang  1.5   NaN
two    2001  Semarang  1.7  -1.2
three  2002  Semarang  3.6   NaN
four   2001      Solo  2.4  -1.5
five   2002      Solo  2.9  -1.7

In [37]:
frame2['pesisir'] = frame2.kutha == 'Semarang'
frame2

       taun     kutha  pop  debt pesisir
one    2000  Semarang  1.5   NaN    True
two    2001  Semarang  1.7  -1.2    True
three  2002  Semarang  3.6   NaN    True
four   2001      Solo  2.4  -1.5   False
five   2002      Solo  2.9  -1.7   False

In [38]:
del frame2['pesisir']
frame2.columns

Index([u'taun', u'kutha', u'pop', u'debt'], dtype='object')

In [39]:
pop = {'Semarang' : {2000: 1.5, 2001:1.7, 2002:3.6},
      'Solo':{2001:2.4, 2002:2.9}}
frame3 = DataFrame(pop)
frame3

      Semarang  Solo
2000       1.5   NaN
2001       1.7   2.4
2002       3.6   2.9

In [40]:
#transpose
frame3.T

          2000  2001  2002
Semarang   1.5   1.7   3.6
Solo       NaN   2.4   2.9

In [41]:
DataFrame(pop, index = [2001,2002,2003])

      Semarang  Solo
2001       1.7   2.4
2002       3.6   2.9
2003       NaN   NaN

In [42]:
pdata = {'Semarang' : frame3['Semarang'][:-1],
        'Solo':frame3['Solo'][:2]}
DataFrame(pdata)

      Semarang  Solo
2000       1.5   NaN
2001       1.7   2.4

In [43]:
frame3.index.name = 'taun'; frame3.columns.name = 'kutha'
frame3

kutha  Semarang  Solo
taun
2000        1.5   NaN
2001        1.7   2.4
2002        3.6   2.9

In [44]:
frame3.values

array([[ 1.5,  nan],
       [ 1.7,  2.4],
       [ 3.6,  2.9]])

In [45]:
frame2.values

array([['2000', 'Semarang', 1.5, nan],
       ['2001', 'Semarang', 1.7, -1.2],
       ['2002', 'Semarang', 3.6, nan],
       ['2001', 'Solo', 2.4, -1.5],
       ['2002', 'Solo', 2.9, -1.7]], dtype=object)

### Index Objects

pandas's index objects are responsible for holding the axis labels and other metadata(like the axis name or names).

In [46]:
obj = Series(range(3), index=['a','b','c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [47]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [48]:
#index[1] = 'd'
#run this to get error

In [49]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index = index)
obj2.index is index

True

In [50]:
frame3

kutha  Semarang  Solo
taun
2000        1.5   NaN
2001        1.7   2.4
2002        3.6   2.9

In [51]:
'Semarang' in frame3.columns

True

In [52]:
2003 in frame3.index

False

## Essential Functionality

### Reindexing
rearange the data acording to the new index, and gave a missing value if not present

In [53]:
obj = Series([4.5,7.2, -5.3, 3.6], index =['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [54]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [55]:
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)

In [56]:
obj3 =  Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [57]:
#DATAframe, reindex can alter either the index, columns or both.
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                 columns=['Semarang','Jogja','Surabaya'])
frame

   Semarang  Jogja  Surabaya
a         0      1         2
c         3      4         5
d         6      7         8

In [58]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Semarang  Jogja  Surabaya
a       0.0    1.0       2.0
b       NaN    NaN       NaN
c       3.0    4.0       5.0
d       6.0    7.0       8.0

In [59]:
states = ['Semarang', 'Solo', 'Jogja']
frame.reindex(columns=states)

   Semarang  Solo  Jogja
a         0   NaN      1
c         3   NaN      4
d         6   NaN      7

In [60]:
frame.reindex(index=['a','b','c','d'], method = 'ffill', columns = states)

   Semarang  Solo  Jogja
a         0   NaN      1
b         0   NaN      1
c         3   NaN      4
d         6   NaN      7

In [61]:
frame.ix[['a','b','c','d'], states]

   Semarang  Solo  Jogja
a       0.0   NaN    1.0
b       NaN   NaN    NaN
c       3.0   NaN    4.0
d       6.0   NaN    7.0

### Dropping entries from an axis

In [62]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [63]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [64]:
#deleting index values from either axis
data = DataFrame(np.arange(16).reshape((4,4)),
                index = ['Jakarta', 'Bogor', 'Bandung', 'Cirebon'],
                columns = ['one','two','three','four'])
data.drop(['Cirebon','Bogor'])

         one  two  three  four
Jakarta    0    1      2     3
Bandung    8    9     10    11

In [65]:
data.drop('two', axis=1)

         one  three  four
Jakarta    0      2     3
Bogor      4      6     7
Bandung    8     10    11
Cirebon   12     14    15

In [66]:
data.drop(['two','four'], axis = 1)

         one  three
Jakarta    0      2
Bogor      4      6
Bandung    8     10
Cirebon   12     14

### Indexing, selection and filtering

In [67]:
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj['b']

1.0

In [68]:
obj[1]

1.0

In [69]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [70]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [71]:
#slicing
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [72]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [73]:
data

         one  two  three  four
Jakarta    0    1      2     3
Bogor      4    5      6     7
Bandung    8    9     10    11
Cirebon   12   13     14    15

In [74]:
data['two']

Jakarta     1
Bogor       5
Bandung     9
Cirebon    13
Name: two, dtype: int32

In [75]:
data[['three','one']]

         three  one
Jakarta      2    0
Bogor        6    4
Bandung     10    8
Cirebon     14   12

In [76]:
data[:2]

         one  two  three  four
Jakarta    0    1      2     3
Bogor      4    5      6     7

In [77]:
data[data['three']>5]

         one  two  three  four
Bogor      4    5      6     7
Bandung    8    9     10    11
Cirebon   12   13     14    15

In [78]:
data < 5

           one    two  three   four
Jakarta   True   True   True   True
Bogor     True  False  False  False
Bandung  False  False  False  False
Cirebon  False  False  False  False

In [79]:
data[data<5]=0
data

         one  two  three  four
Jakarta    0    0      0     0
Bogor      0    5      6     7
Bandung    8    9     10    11
Cirebon   12   13     14    15

In [80]:
#select row and column
data.ix['Jakarta',['two','three']]

two      0
three    0
Name: Jakarta, dtype: int32

In [81]:
data.ix[['Jakarta','Bandung'],[3,0,1]]

         four  one  two
Jakarta     0    0    0
Bandung    11    8    9

In [82]:
#select row
data.ix[2]

one       8
two       9
three    10
four     11
Name: Bandung, dtype: int32

In [83]:
data.ix[:'Cirebon','two']

Jakarta     0
Bogor       5
Bandung     9
Cirebon    13
Name: two, dtype: int32

In [84]:
data.ix[data.three>5,:3]

         one  two  three
Bogor      0    5      6
Bandung    8    9     10
Cirebon   12   13     14

### Arithmetic and data alignment

In [85]:
s1= Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])
s2= Series([-2.1,3.6,-1.5,4,3.1], index =['a','c','e','f','g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [86]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [87]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [88]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('abc'), 
                index=['Ahok','Bambang','Tommy'])
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bcd'),
                index=['Ahok','Jokowi','Prabowo','Tommy'])
df1

           a    b    c
Ahok     0.0  1.0  2.0
Bambang  3.0  4.0  5.0
Tommy    6.0  7.0  8.0

In [89]:
df2

           b     c     d
Ahok     0.0   1.0   2.0
Jokowi   3.0   4.0   5.0
Prabowo  6.0   7.0   8.0
Tommy    9.0  10.0  11.0

In [90]:
df1+df2

          a     b     c   d
Ahok    NaN   1.0   3.0 NaN
Bambang NaN   NaN   NaN NaN
Jokowi  NaN   NaN   NaN NaN
Prabowo NaN   NaN   NaN NaN
Tommy   NaN  16.0  18.0 NaN

#### Arithmetic methods with fill values

In [91]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [92]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [93]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [94]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [95]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [96]:
arr = np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [97]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [98]:
arr - arr [0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [99]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                 index = ['Semarang','Bandung','Jakarta','Surabaya'])
series = frame.ix[0]
frame

            b     d     e
Semarang  0.0   1.0   2.0
Bandung   3.0   4.0   5.0
Jakarta   6.0   7.0   8.0
Surabaya  9.0  10.0  11.0

In [100]:
series

b    0.0
d    1.0
e    2.0
Name: Semarang, dtype: float64

In [101]:
frame - series

            b    d    e
Semarang  0.0  0.0  0.0
Bandung   3.0  3.0  3.0
Jakarta   6.0  6.0  6.0
Surabaya  9.0  9.0  9.0

In [102]:
series2 = Series(range(3), index = ['b','e','f'])
frame + series2

            b   d     e   f
Semarang  0.0 NaN   3.0 NaN
Bandung   3.0 NaN   6.0 NaN
Jakarta   6.0 NaN   9.0 NaN
Surabaya  9.0 NaN  12.0 NaN

In [103]:
series3 = frame['d']
frame

            b     d     e
Semarang  0.0   1.0   2.0
Bandung   3.0   4.0   5.0
Jakarta   6.0   7.0   8.0
Surabaya  9.0  10.0  11.0

In [104]:
series3

Semarang     1.0
Bandung      4.0
Jakarta      7.0
Surabaya    10.0
Name: d, dtype: float64

In [105]:
frame.sub(series3,axis=0)

            b    d    e
Semarang -1.0  0.0  1.0
Bandung  -1.0  0.0  1.0
Jakarta  -1.0  0.0  1.0
Surabaya -1.0  0.0  1.0

### Function application and mapping

In [106]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index = ['Semarang','Bandung','Jakarta','Surabaya'])
frame

                 b         d         e
Semarang -0.204708  0.478943 -0.519439
Bandung  -0.555730  1.965781  1.393406
Jakarta   0.092908  0.281746  0.769023
Surabaya  1.246435  1.007189 -1.296221

In [107]:
np.abs(frame)

                 b         d         e
Semarang  0.204708  0.478943  0.519439
Bandung   0.555730  1.965781  1.393406
Jakarta   0.092908  0.281746  0.769023
Surabaya  1.246435  1.007189  1.296221

In [108]:
f= lambda x: x.max() - x.min()
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [109]:
frame.apply(f,axis=1)

Semarang    0.998382
Bandung     2.521511
Jakarta     0.676115
Surabaya    2.542656
dtype: float64

In [110]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [111]:
format = lambda x: '%.2f' % x
frame.applymap(format)

              b     d      e
Semarang  -0.20  0.48  -0.52
Bandung   -0.56  1.97   1.39
Jakarta    0.09  0.28   0.77
Surabaya   1.25  1.01  -1.30

In [112]:
frame['e'].map(format)

Semarang    -0.52
Bandung      1.39
Jakarta      0.77
Surabaya    -1.30
Name: e, dtype: object

### Sorting and ranking

In [113]:
obj = Series(range(4), index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [114]:
frame.sort_index(axis=1, ascending=False)

                 e         d         b
Semarang -0.519439  0.478943 -0.204708
Bandung   1.393406  1.965781 -0.555730
Jakarta   0.769023  0.281746  0.092908
Surabaya -1.296221  1.007189  1.246435

In [115]:
obj = Series([4,7,-3,2])
obj.sort_values()
#nan will be sorted to the end of the Series

C:\Users\znsvs\AppData\Local\Enthought\Canopy\User\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

2   -3
3    2
0    4
1    7
dtype: int64

In [116]:
frame = DataFrame({'b' : [4,7,-3,2], 'a': [0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [117]:
frame.sort_values(['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [118]:
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [119]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [120]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [121]:
frame = DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1], 'c':[-2,5,8,-2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [122]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [123]:
obj = Series(range(5), index = ['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [124]:
#are those unique?
obj.index.is_unique

False

In [125]:
obj['a']

a    0
a    1
dtype: int64

In [126]:
obj['c']

4

In [127]:
#extends for dataframe
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [128]:
df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and Computing descriptivie statistic

In [129]:
df = DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3]], 
               index = ['a','b','c','d'], columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [130]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [131]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [132]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [133]:
df.idxmax()

one    b
two    d
dtype: object

In [134]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [135]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [136]:
obj= Series(['a','a','b','c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [137]:
import pandas_datareader as web
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
price = DataFrame({tic:data['Adj Close']
                  for tic, data in all_data.iteritems()})
volume = DataFrame({tic:data['Volume']
                   for tic, data in all_data.iteritems()})

C:\Users\znsvs\AppData\Local\Enthought\Canopy\User\lib\site-packages\pandas\io\data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

### Unique

In [138]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [139]:
returns.MSFT.corr(returns.IBM)

0.49597967972033746

In [140]:
returns.MSFT.cov(returns.IBM)

0.00021595764064430046

In [141]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [142]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [143]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [144]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

### Unique Values, value counts and membership

In [145]:
obj = Series(['c','a','d','a','a','b','b', 'c','c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [146]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [147]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [148]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [149]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [150]:
data = DataFrame({'Qu1': [1,3,4,3,4],
                 'Qu2' : [2,3,1,2,3],
                 'Qu3' : [1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [151]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling Missing Data

In [152]:
string_data = Series(['nanas','pisang', np.nan, 'rambutan'])
string_data

0       nanas
1      pisang
2         NaN
3    rambutan
dtype: object

In [153]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [154]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [155]:

#remove NA
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [156]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [157]:
data = DataFrame([[1.,6.5,3.], [1.,NA,NA], [NA,NA,NA], [NA, 6.5,3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [158]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [159]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [160]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [161]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [162]:
df = DataFrame(np.random.randn(7,3))
df.ix[:4, 1] = NA ; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [163]:
df.dropna(thresh=3)

          0         1         2
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in Missing Data

In [164]:
df.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [165]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.577087  0.500000       NaN
1  0.523772  0.500000       NaN
2 -0.713544  0.500000       NaN
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [166]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

## Hierarchical Indexing

In [167]:
data = Series(np.random.randn(10),
             index = [['a','a','a','b','b','b', 'c','c','d','d'],
                     [1,2,3,1,2,3,1,2,2,3]])
data

a  1    0.286350
   2    0.377984
   3   -0.753887
b  1    0.331286
   2    1.349742
   3    0.069877
c  1    0.246674
   2   -0.011862
d  2    1.004812
   3    1.327195
dtype: float64

In [168]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [169]:
data['b']

1    0.331286
2    1.349742
3    0.069877
dtype: float64

In [170]:
data['b':'c']

b  1    0.331286
   2    1.349742
   3    0.069877
c  1    0.246674
   2   -0.011862
dtype: float64

In [171]:
data.ix[['b','d']]

b  1    0.331286
   2    1.349742
   3    0.069877
d  2    1.004812
   3    1.327195
dtype: float64

In [172]:
data[:,2]

a    0.377984
b    1.349742
c   -0.011862
d    1.004812
dtype: float64

In [173]:
data.unstack()

          1         2         3
a  0.286350  0.377984 -0.753887
b  0.331286  1.349742  0.069877
c  0.246674 -0.011862       NaN
d       NaN  1.004812  1.327195

In [174]:
data.unstack().stack

<bound method DataFrame.stack of           1         2         3
a  0.286350  0.377984 -0.753887
b  0.331286  1.349742  0.069877
c  0.246674 -0.011862       NaN
d       NaN  1.004812  1.327195>

In [175]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a','a','b','b'],[1,2,1,2]],
                 columns = [['Ohio', 'Ohio', 'Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [176]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [177]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Reordering and sorting levels

In [178]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [179]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [180]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [181]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [182]:
frame.swaplevel(0,1).sortlevel

<bound method DataFrame.sortlevel of state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11>

### Summary statistic by Levels

In [183]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [184]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### using a dataframe's columns

In [185]:
frame = DataFrame ({'a' : range(7), 'b' : range(7,0,-1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd' : [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

## Other pandas topics

In [188]:
### integer indexing
ser = Series(np.arange(3.))
#ser[-1]
#run above to get error
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [190]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [191]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [202]:
ser3 = Series(range(3), index=[-5,1,3])
ser3.iget_value(2)

C:\Users\znsvs\AppData\Local\Enthought\Canopy\User\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  from ipykernel import kernelapp as app

2

In [201]:
frame = DataFrame(np.arange(6).reshape(3,2),index=[2,0,1])
frame.irow(0)

C:\Users\znsvs\AppData\Local\Enthought\Canopy\User\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  from ipykernel import kernelapp as app

0    0
1    1
Name: 2, dtype: int32